read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/carry_save_adder.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/cla_adder.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/wallace_multiplier.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/mac_unit.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/processing_element.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/mac_array.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/matrix_buffer.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/address_generator.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/accel_regbank.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/accelerator_fsm.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/axi_accel_slave.v
read_verilog -sv -I../rtl -I../../BUS/rtl ../rtl/matrix_accelerator_top.v

synth -top matrix_accelerator_top

dfflibmap -liberty /Users/lakshyachowdhury/pdks/volare/sky130/versions/0fe599b2afb6708d281543108caf8310912f54af/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

abc -liberty /Users/lakshyachowdhury/pdks/volare/sky130/versions/0fe599b2afb6708d281543108caf8310912f54af/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

opt_clean -purge

stat -liberty /Users/lakshyachowdhury/pdks/volare/sky130/versions/0fe599b2afb6708d281543108caf8310912f54af/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

write_verilog -noattr ../synthesis/netlists/accel_sky130_netlist.v
